schedule.org
#+title: Schedule
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../globalStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:1 num:nil
#+HTML_LINK_HOME: index.html
* Week 1
** TUE 09-03 Lecture 1
:PROPERTIES:
:CUSTOM_ID: 09-03
:END:
*** Title: *Linear Equations*
*** Topics:
+ Introduce systems of linear equations and discuss how to solve them
+ Learn how to use matrices to represent systems of linear equations
+ Examine the relationship between row operations and solving systems
  of linear equations
+ Use SymPy to solve systems of linear equations with a computer
*** Material:
**** Reading:
***** Linear Algebra, Geomtry, and Computation (LAGC): [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html][Linear Equations]]
***** Interactive Linear Algebra (ILL) 1.1: [[https://textbooks.math.gatech.edu/ila/systems-of-eqns.html][Systems of Linear Equations]]
***** Sympy: [[https://docs.sympy.org/latest/tutorials/intro-tutorial/matrices.html][Matrices]]
**** Slides:
*** Reminders:
+ read course information and [[https://nmmull.github.io/pages/policies.html][course policies]]
+ install Python + libraries
+ get access to Piazza and Gradescope
+ *No office hours this week*
** THU 09-05 Lecture 2
:PROPERTIES:
:CUSTOM_ID: 09-05
:END:
*** Title: *Gaussian Elimination*
*** Topics:
+ Introduce and analyze Gaussian elimination, an algorithm for
  solving general systems of linear equations
+ Understand the shape of matrices which represent solutions to a
  system of linear equations (we need to know how to /read off/ a
  solution from the output of Gaussian elimination)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html][Gaussian Elimination]]
***** ILA 1.2: [[https://textbooks.math.gatech.edu/ila/row-reduction.html][Row Reductions]]
**** Slides:
**** *Homework 1:*
*** Reminders:
+ Homework 1 is assigned
** FRI/MON 09-06/09 Discussion 1
:PROPERTIES:
:CUSTOM_ID: 09-06
:END:
*** Topics:
+ Set up your Python environment (with help from the TF/TAs)
+ Practice with SymPy
*** Material:
*** Reminders:
* Week 2
** TUE 09-10 Lecture 3
:PROPERTIES:
:CUSTOM_ID: 09-10
:END:
*** Title: *Vector Equations*
*** Topics:
+ Connect the algebraic notion of a linear equation to the geometric
  notation of a vectors
+ See how geometric properties of vectors reduce to solving systems of
  linear equations
+ Look at the /algebra/ of vectors
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html][Vector Equations]]
***** ILA 2.1: [[https://textbooks.math.gatech.edu/ila/vectors.html][Vectors]]
***** ILA 2.2: [[https://textbooks.math.gatech.edu/ila/spans.html][Vector Equations and Spans]]
**** Slides:
*** Reminders:
** THU 09-12 Lecture 4
:PROPERTIES:
:CUSTOM_ID: 09-12
:END:
*** Title: *Matrix-Vector Equations*
*** Topics:
+ Define matrix-vector multiplication
+ Use matrices-vector equations to represent systems of linear
  equations
+ Look at the /algebra/ of matrices and vectors
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html][Ax = b]]
***** ILA 2.3: [[https://textbooks.math.gatech.edu/ila/matrix-equations.html][Matrix Equations]]
**** Slides:
**** *Homework 2:*
*** Reminders:
+ Homework 1 is due
+ Homework 2 is assigned
** FRI/MON 09-13/16 Discussion 2
:PROPERTIES:
:CUSTOM_ID: 09-13
:END:
*** Topics:
+ Practice with matrices and vectors
+ More practice with SymPy
*** Material:
*** Reminders:
* Week 3
** TUE 09-17 Lecture 5
:PROPERTIES:
:CUSTOM_ID: 09-17
:END:
*** Title: *Linear Independence*
*** Topics:
+ Introduce notion of linear independence as a way to understand if
  the span of a set of vectors is "as large as possible"
+ Examine the relationship between linear independence and systems of
  linear equations (in particular, look at what the /shape/ of a
  matrix says about the linear dependences of its columns)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html][Linear Independence]]
***** ILA 2.5: [[https://textbooks.math.gatech.edu/ila/linear-independence.html][Linear Independence]]
**** Slides:
*** Reminders:
** THU 09-19 Lecture 6
:PROPERTIES:
:CUSTOM_ID: 09-19
:END:
*** Title: *Numerics*
*** Topics:
+ Revisit the problem of solving systems of linear equations with
  computers, this time in the presence of floating-point error
+ Look more deeply at NumPy and how it can be used to reason about the
  concepts we've seen so far
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L02Numerics.html][Numerics]]
***** Numpy: [[https://numpy.org/doc/stable/user/absolute_beginners.html][the absolute basics for beginners]]
