schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-21 Wed 11:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Schedule</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Schedule</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org794f511">Week 1</a></li>
<li><a href="#orgf987ed2">Week 2</a></li>
<li><a href="#orge15b0f8">Week 3</a></li>
<li><a href="#org83caad2">Week 4</a></li>
<li><a href="#org2f263f7">Week 5</a></li>
<li><a href="#org56eb30e">Week 6</a></li>
<li><a href="#org16d53ee">Week 7</a></li>
<li><a href="#org950eaef">Week 8</a></li>
<li><a href="#org080a0bd">Week 9</a></li>
<li><a href="#org050fd92">Week 10</a></li>
<li><a href="#orgdfa2911">Week 11</a></li>
<li><a href="#org970fdb6">Week 12</a></li>
<li><a href="#org4459de2">Week 13</a></li>
<li><a href="#orge4c513a">Week 14</a></li>
<li><a href="#orgabab3e1">Week 15</a></li>
<li><a href="#org1576348">Week 16</a></li>
</ul>
</div>
</div>
<div id="outline-container-org794f511" class="outline-2">
<h2 id="org794f511">Week 1</h2>
<div class="outline-text-2" id="text-org794f511">
</div>
<div id="outline-container-09-03" class="outline-3">
<h3 id="09-03">TUE 09-03 Lecture 1</h3>
<div class="outline-text-3" id="text-09-03">
</div>
<ul class="org-ul">
<li><a id="orgf77be0f"></a>Title: <b>Linear Equations</b><br /></li>
<li><a id="orgb42677a"></a>Topics:<br />
<div class="outline-text-4" id="text-orgb42677a">
<ul class="org-ul">
<li>Introduce systems of linear equations and discuss how to solve them</li>
<li>Learn how to use matrices to represent systems of linear equations</li>
<li>Examine the relationship between row operations and solving systems
of linear equations</li>
<li>Use SymPy to solve systems of linear equations with a computer</li>
</ul>
</div>
</li>
<li><a id="org5f69267"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgf1d9529"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org22a5c5d"></a>Linear Algebra, Geomtry, and Computation (LAGC): <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L01LinearEquations.html">Linear Equations</a><br /></li>
<li><a id="org99880ec"></a>Interactive Linear Algebra (ILL) 1.1: <a href="https://textbooks.math.gatech.edu/ila/systems-of-eqns.html">Systems of Linear Equations</a><br /></li>
<li><a id="orgd4ec0e4"></a>Sympy: <a href="https://docs.sympy.org/latest/tutorials/intro-tutorial/matrices.html">Matrices</a><br /></li>
</ul>
</li>
<li><a id="org5146c34"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org290fde6"></a>Reminders:<br />
<div class="outline-text-4" id="text-org290fde6">
<ul class="org-ul">
<li>read course information and <a href="https://nmmull.github.io/pages/policies.html">course policies</a></li>
<li>install Python + libraries</li>
<li>get access to Piazza and Gradescope</li>
<li><b>No office hours this week</b></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-09-05" class="outline-3">
<h3 id="09-05">THU 09-05 Lecture 2</h3>
<div class="outline-text-3" id="text-09-05">
</div>
<ul class="org-ul">
<li><a id="orga98a77d"></a>Title: <b>Gaussian Elimination</b><br /></li>
<li><a id="org25a9dde"></a>Topics:<br />
<div class="outline-text-4" id="text-org25a9dde">
<ul class="org-ul">
<li>Introduce and analyze Gaussian elimination, an algorithm for
solving general systems of linear equations</li>
<li>Understand the shape of matrices which represent solutions to a
system of linear equations (we need to know how to <i>read off</i> a
solution from the output of Gaussian elimination)</li>
</ul>
</div>
</li>
<li><a id="orga789e39"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgc2c57e4"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org6901101"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L03RowReductions.html">Gaussian Elimination</a><br /></li>
<li><a id="orgc1aa7db"></a>ILA 1.2: <a href="https://textbooks.math.gatech.edu/ila/row-reduction.html">Row Reductions</a><br /></li>
</ul>
</li>
<li><a id="orgfb20933"></a>Slides:<br /></li>
<li><a id="org4457050"></a><b>Homework 1:</b><br /></li>
</ul>
</li>
<li><a id="orgb80341c"></a>Reminders:<br />
<div class="outline-text-4" id="text-orgb80341c">
<ul class="org-ul">
<li>Homework 1 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-09-06" class="outline-3">
<h3 id="09-06">FRI/MON 09-06/09 Discussion 1</h3>
<div class="outline-text-3" id="text-09-06">
</div>
<ul class="org-ul">
<li><a id="org1dd8715"></a>Topics:<br />
<div class="outline-text-4" id="text-org1dd8715">
<ul class="org-ul">
<li>Set up your Python environment (with help from the TF/TAs)</li>
<li>Practice with SymPy</li>
</ul>
</div>
</li>
<li><a id="org671e2aa"></a>Material:<br /></li>
<li><a id="org766e671"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf987ed2" class="outline-2">
<h2 id="orgf987ed2">Week 2</h2>
<div class="outline-text-2" id="text-orgf987ed2">
</div>
<div id="outline-container-09-10" class="outline-3">
<h3 id="09-10">TUE 09-10 Lecture 3</h3>
<div class="outline-text-3" id="text-09-10">
</div>
<ul class="org-ul">
<li><a id="org580a6ea"></a>Title: <b>Vector Equations</b><br /></li>
<li><a id="org58d98dd"></a>Topics:<br />
<div class="outline-text-4" id="text-org58d98dd">
<ul class="org-ul">
<li>Connect the algebraic notion of a linear equation to the geometric
notation of a vectors</li>
<li>See how geometric properties of vectors reduce to solving systems of
linear equations</li>
<li>Look at the <i>algebra</i> of vectors</li>
</ul>
</div>
</li>
<li><a id="orgfc87e6a"></a>Material:<br />
<ul class="org-ul">
<li><a id="org739a5d1"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgfaf215d"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L04VectorEquations.html">Vector Equations</a><br /></li>
<li><a id="orgbe2bd41"></a>ILA 2.1: <a href="https://textbooks.math.gatech.edu/ila/vectors.html">Vectors</a><br /></li>
<li><a id="orga4d42eb"></a>ILA 2.2: <a href="https://textbooks.math.gatech.edu/ila/spans.html">Vector Equations and Spans</a><br /></li>
</ul>
</li>
<li><a id="org055d8e3"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org764f9d1"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-09-12" class="outline-3">
<h3 id="09-12">THU 09-12 Lecture 4</h3>
<div class="outline-text-3" id="text-09-12">
</div>
<ul class="org-ul">
<li><a id="org477d008"></a>Title: <b>Matrix-Vector Equations</b><br /></li>
<li><a id="orgf31e3b1"></a>Topics:<br />
<div class="outline-text-4" id="text-orgf31e3b1">
<ul class="org-ul">
<li>Define matrix-vector multiplication</li>
<li>Use matrices-vector equations to represent systems of linear
equations</li>
<li>Look at the <i>algebra</i> of matrices and vectors</li>
</ul>
</div>
</li>
<li><a id="org400a1b1"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgdc7ef92"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org04b9888"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L05Axb.html">Ax = b</a><br /></li>
<li><a id="orge949bd7"></a>ILA 2.3: <a href="https://textbooks.math.gatech.edu/ila/matrix-equations.html">Matrix Equations</a><br /></li>
</ul>
</li>
<li><a id="org3b6f852"></a>Slides:<br /></li>
<li><a id="org4c47fad"></a><b>Homework 2:</b><br /></li>
</ul>
</li>
<li><a id="org8cb4908"></a>Reminders:<br />
<div class="outline-text-4" id="text-org8cb4908">
<ul class="org-ul">
<li>Homework 1 is due</li>
<li>Homework 2 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-09-13" class="outline-3">
<h3 id="09-13">FRI/MON 09-13/16 Discussion 2</h3>
<div class="outline-text-3" id="text-09-13">
</div>
<ul class="org-ul">
<li><a id="org5edfd43"></a>Topics:<br />
<div class="outline-text-4" id="text-org5edfd43">
<ul class="org-ul">
<li>Practice with matrices and vectors</li>
<li>More practice with SymPy</li>
</ul>
</div>
</li>
<li><a id="org905e6d6"></a>Material:<br /></li>
<li><a id="org3a8878a"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orge15b0f8" class="outline-2">
<h2 id="orge15b0f8">Week 3</h2>
<div class="outline-text-2" id="text-orge15b0f8">
</div>
<div id="outline-container-09-17" class="outline-3">
<h3 id="09-17">TUE 09-17 Lecture 5</h3>
<div class="outline-text-3" id="text-09-17">
</div>
<ul class="org-ul">
<li><a id="org55b1d7d"></a>Title: <b>Linear Independence</b><br /></li>
<li><a id="org4d01bc3"></a>Topics:<br />
<div class="outline-text-4" id="text-org4d01bc3">
<ul class="org-ul">
<li>Introduce notion of linear independence as a way to understand if
the span of a set of vectors is "as large as possible"</li>
<li>Examine the relationship between linear independence and systems of
linear equations (in particular, look at what the <i>shape</i> of a
matrix says about the linear dependences of its columns)</li>
</ul>
</div>
</li>
<li><a id="org1ec8b61"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgcbfe232"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org577f99e"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L06LinearIndependence.html">Linear Independence</a><br /></li>
<li><a id="orged9fd7a"></a>ILA 2.5: <a href="https://textbooks.math.gatech.edu/ila/linear-independence.html">Linear Independence</a><br /></li>
</ul>
</li>
<li><a id="org2ca8643"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org4f09393"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-09-19" class="outline-3">
<h3 id="09-19">THU 09-19 Lecture 6</h3>
<div class="outline-text-3" id="text-09-19">
</div>
<ul class="org-ul">
<li><a id="org74960b5"></a>Title: <b>Numerics</b><br /></li>
<li><a id="orgfb60938"></a>Topics:<br />
<div class="outline-text-4" id="text-orgfb60938">
<ul class="org-ul">
<li>Revisit the problem of solving systems of linear equations with
computers, this time in the presence of floating-point error</li>
<li>Look more deeply at NumPy and how it can be used to reason about the
concepts we've seen so far</li>
</ul>
</div>
</li>
<li><a id="org8170f39"></a>Material:<br />
<ul class="org-ul">
<li><a id="org6ac6e00"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orga8dc969"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L02Numerics.html">Numerics</a><br /></li>
<li><a id="org0ffc47c"></a>Numpy: <a href="https://numpy.org/doc/stable/user/absolute_beginners.html">the absolute basics for beginners</a><br /></li>
