schedule.org
***** Floating-Point Arithemtic: [[https://docs.python.org/3/tutorial/floatingpoint.html][Issues and Limitations]]
***** TODO Supplementary Tutorial on NumPy
**** Slides:
**** [[https://www.h-schmidt.net/FloatConverter/IEEE754.html][IEEE 754 Converter]]
**** *Homework 3:*
*** Reminders:
+ Homework 2 is due
+ Homework 3 is assigned
** FRI/MON 09-20/23 Discussion 3
:PROPERTIES:
:CUSTOM_ID: 09-20
:END:
*** Topics:
+ Practice with vectors, spans, and linear independence
+ Practice with NumPy (compare to SymPy)
*** Material:
*** Reminders:
* Week 4
** TUE 09-24 Lecture 7
:PROPERTIES:
:CUSTOM_ID: 09-24
:END:
*** Title: *Linear Transformations*
*** Topics:
+ Introduce linearity as a way of describing "well-behaved" functions
  on vectors.
+ See examples and non-examples of linear functions (in particular,
  look at matrix-vector multiplication as the canonical example of a
  linear transformation)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html][Linear Transformations]]
***** ILA 3.1: [[https://textbooks.math.gatech.edu/ila/matrix-transformations.html][Matrix Transformations]]
***** ILA 3.3: [[https://textbooks.math.gatech.edu/ila/linear-transformations.html][Linear Transformations]]
**** Slides:
*** Reminders:
** THU 09-26 Lecture 8
:PROPERTIES:
:CUSTOM_ID: 09-26
:END:
*** Title: *Matrices of Linear Transformations*
*** Topics:
+ Show that, in fact, /every/ linear transformation can be represented
  as a matrix transformation
+ Introduce the notion of a /basis/ (the simplest example being the
  /standard basis/) as a way of "decomposing" vectors simpler parts
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html][Matrix of a Linear Transformation]]
***** ILA 3.2: [[https://textbooks.math.gatech.edu/ila/one-to-one-onto.html][One-to-one and Onto Transformations]]
***** ILA 3.3: [[https://textbooks.math.gatech.edu/ila/linear-transformations.html][Linear Transformations]]
**** Slides:
**** *Homework 4:*
*** Reminders:
+ Homework 3 is due
+ Homework 4 is assigned
** FRI/MON 09-27/30 Discussion 4
:PROPERTIES:
:CUSTOM_ID: 09-27
:END:
*** Topics:
+ Practice with linear transformations
*** Material:
*** Reminders:
* Week 5
** TUE 10-01 Lecture 9
:PROPERTIES:
:CUSTOM_ID: 10-01
:END:
*** Title: *Matrix Algebra*
*** Topics:
+ Define matrix multiplication and look at how it interacts with other
  matrix operations like addition and scalar multiplication
+ Connection matrix multiplication with the /composition/ of linear
  transformations
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html][Matrix Algebra]]
***** ILA 3.4: [[https://textbooks.math.gatech.edu/ila/matrix-multiplication.html][Matrix Multiplication]]
**** Slides:
*** Reminders:
** THU 10-03 Lecture 10
:PROPERTIES:
:CUSTOM_ID: 10-03
:END:
*** Title: *Matrix Inverse*
*** Topics:
+ Show how to "divide" by a matrix as a way of solving systems of
  linear equations (when possible)
+ Examine how matrix inversion interacts with other matrix operations
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html][The Inverse of a Matrix]]
***** ILA 3.5: [[https://textbooks.math.gatech.edu/ila/matrix-inverses.html][Matrix Inverses]]
***** ILA 3.6: [[https://textbooks.math.gatech.edu/ila/invertible-matrix-thm.html][The Invertible Matrix Theorem]]
**** Slides:
**** *Homework 5:*
*** Reminders:
+ Homework 4 is due
+ Homework 5 is assigned
** FRI/MON 10-04/07 Discussion 5
:PROPERTIES:
:CUSTOM_ID: 10-04
:END:
*** Topics:
+ Practice with matrix inversion
+ More Practice with NumPy
*** Material:
*** Reminders:
* Week 6
** TUE 10-08 Lecture 11
:PROPERTIES:
:CUSTOM_ID: 10-08
:END:
*** Title: *Invertible Matrix Theorem*
*** Topics:
+ Review matrix inversion
+ Connect everything we've seen so far in the case of square matrices
  (one theorem to rule them all...)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html][The Inverse of a Matrix]]
***** ILA 3.6: [[https://textbooks.math.gatech.edu/ila/invertible-matrix-thm.html][The Invertible Matrix Theorem]]
**** Slides:
*** Reminders:
** THU 10-10 Lecture 12
:PROPERTIES:
:CUSTOM_ID: 10-10
:END:
*** Title: *Numerics and NumPy (Part II)*
*** Topics:
+ Revisit NumPy, taking stock of how it can be used to reason about
  the algebra of matrices
+ See some more involved examples of using NumPy
*** Material:
**** Reading:
**** Slides:
**** *Homework 6:*
*** Reminders:
+ Homework 5 is due
+ Homework 6 is assigned
** FRI/TUE 10-11/15 Discussion 6
:PROPERTIES:
:CUSTOM_ID: 10-11
:END:
*** Topics:
+ More practice with matrix inversion
+ More practice with NumPy
*** Material:
*** Reminders:
+ The discussion section normally held on Monday *will be held on
  Tuesday* because of Indigenous People's Day
* Week 7
