schedule.html
<li><a id="org6025ae6"></a>Floating-Point Arithemtic: <a href="https://docs.python.org/3/tutorial/floatingpoint.html">Issues and Limitations</a><br /></li>
<li><a id="org69b218b"></a><span class="todo TODO">TODO</span> Supplementary Tutorial on NumPy<br /></li>
</ul>
</li>
<li><a id="orgcfe27b6"></a>Slides:<br /></li>
<li><a id="org53fa0dc"></a><a href="https://www.h-schmidt.net/FloatConverter/IEEE754.html">IEEE 754 Converter</a><br /></li>
<li><a id="org35b2cdf"></a><b>Homework 3:</b><br /></li>
</ul>
</li>
<li><a id="orge15b452"></a>Reminders:<br />
<div class="outline-text-4" id="text-orge15b452">
<ul class="org-ul">
<li>Homework 2 is due</li>
<li>Homework 3 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-09-20" class="outline-3">
<h3 id="09-20">FRI/MON 09-20/23 Discussion 3</h3>
<div class="outline-text-3" id="text-09-20">
</div>
<ul class="org-ul">
<li><a id="org4a0235e"></a>Topics:<br />
<div class="outline-text-4" id="text-org4a0235e">
<ul class="org-ul">
<li>Practice with vectors, spans, and linear independence</li>
<li>Practice with NumPy (compare to SymPy)</li>
</ul>
</div>
</li>
<li><a id="orgad1cffe"></a>Material:<br /></li>
<li><a id="orgb448ec5"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org83caad2" class="outline-2">
<h2 id="org83caad2">Week 4</h2>
<div class="outline-text-2" id="text-org83caad2">
</div>
<div id="outline-container-09-24" class="outline-3">
<h3 id="09-24">TUE 09-24 Lecture 7</h3>
<div class="outline-text-3" id="text-09-24">
</div>
<ul class="org-ul">
<li><a id="org4343849"></a>Title: <b>Linear Transformations</b><br /></li>
<li><a id="org755f4b6"></a>Topics:<br />
<div class="outline-text-4" id="text-org755f4b6">
<ul class="org-ul">
<li>Introduce linearity as a way of describing "well-behaved" functions
on vectors.</li>
<li>See examples and non-examples of linear functions (in particular,
look at matrix-vector multiplication as the canonical example of a
linear transformation)</li>
</ul>
</div>
</li>
<li><a id="orge5db6ee"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgb7daa41"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgc8e5d37"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L07LinearTransformations.html">Linear Transformations</a><br /></li>
<li><a id="org460ddcd"></a>ILA 3.1: <a href="https://textbooks.math.gatech.edu/ila/matrix-transformations.html">Matrix Transformations</a><br /></li>
<li><a id="org1a37675"></a>ILA 3.3: <a href="https://textbooks.math.gatech.edu/ila/linear-transformations.html">Linear Transformations</a><br /></li>
</ul>
</li>
<li><a id="orgc62c81c"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgc4fd6ed"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-09-26" class="outline-3">
<h3 id="09-26">THU 09-26 Lecture 8</h3>
<div class="outline-text-3" id="text-09-26">
</div>
<ul class="org-ul">
<li><a id="orgd6bc232"></a>Title: <b>Matrices of Linear Transformations</b><br /></li>
<li><a id="org67945a1"></a>Topics:<br />
<div class="outline-text-4" id="text-org67945a1">
<ul class="org-ul">
<li>Show that, in fact, <i>every</i> linear transformation can be represented
as a matrix transformation</li>
<li>Introduce the notion of a <i>basis</i> (the simplest example being the
<i>standard basis</i>) as a way of "decomposing" vectors simpler parts</li>
</ul>
</div>
</li>
<li><a id="org4ccbe4f"></a>Material:<br />
<ul class="org-ul">
<li><a id="org2f0dbee"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org9c1c7d3"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L08MatrixofLinearTranformation.html">Matrix of a Linear Transformation</a><br /></li>
<li><a id="org13513d5"></a>ILA 3.2: <a href="https://textbooks.math.gatech.edu/ila/one-to-one-onto.html">One-to-one and Onto Transformations</a><br /></li>
<li><a id="org8078393"></a>ILA 3.3: <a href="https://textbooks.math.gatech.edu/ila/linear-transformations.html">Linear Transformations</a><br /></li>
</ul>
</li>
<li><a id="org6735ebf"></a>Slides:<br /></li>
<li><a id="org895ff37"></a><b>Homework 4:</b><br /></li>
</ul>
</li>
<li><a id="org51faeab"></a>Reminders:<br />
<div class="outline-text-4" id="text-org51faeab">
<ul class="org-ul">
<li>Homework 3 is due</li>
<li>Homework 4 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-09-27" class="outline-3">
<h3 id="09-27">FRI/MON 09-27/30 Discussion 4</h3>
<div class="outline-text-3" id="text-09-27">
</div>
<ul class="org-ul">
<li><a id="org6b2d5eb"></a>Topics:<br />
<div class="outline-text-4" id="text-org6b2d5eb">
<ul class="org-ul">
<li>Practice with linear transformations</li>
</ul>
</div>
</li>
<li><a id="orgaa3bb69"></a>Material:<br /></li>
<li><a id="orgad6e9c1"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org2f263f7" class="outline-2">
<h2 id="org2f263f7">Week 5</h2>
<div class="outline-text-2" id="text-org2f263f7">
</div>
<div id="outline-container-10-01" class="outline-3">
<h3 id="10-01">TUE 10-01 Lecture 9</h3>
<div class="outline-text-3" id="text-10-01">
</div>
<ul class="org-ul">
<li><a id="org3718ae6"></a>Title: <b>Matrix Algebra</b><br /></li>
<li><a id="org476a2c0"></a>Topics:<br />
<div class="outline-text-4" id="text-org476a2c0">
<ul class="org-ul">
<li>Define matrix multiplication and look at how it interacts with other
matrix operations like addition and scalar multiplication</li>
<li>Connection matrix multiplication with the <i>composition</i> of linear
transformations</li>
</ul>
</div>
</li>
<li><a id="orga117d98"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgc40c1ca"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org9f60d61"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L09MatrixOperations.html">Matrix Algebra</a><br /></li>
<li><a id="org133b71f"></a>ILA 3.4: <a href="https://textbooks.math.gatech.edu/ila/matrix-multiplication.html">Matrix Multiplication</a><br /></li>
</ul>
</li>
<li><a id="org2abcdb2"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgeb7ee2b"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-10-03" class="outline-3">
<h3 id="10-03">THU 10-03 Lecture 10</h3>
<div class="outline-text-3" id="text-10-03">
</div>
<ul class="org-ul">
<li><a id="orge92e293"></a>Title: <b>Matrix Inverse</b><br /></li>
<li><a id="org10233df"></a>Topics:<br />
<div class="outline-text-4" id="text-org10233df">
<ul class="org-ul">
<li>Show how to "divide" by a matrix as a way of solving systems of
linear equations (when possible)</li>
<li>Examine how matrix inversion interacts with other matrix operations</li>
</ul>
</div>
</li>
<li><a id="org01e647c"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgdc902e7"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org3ca5372"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html">The Inverse of a Matrix</a><br /></li>
<li><a id="org0987257"></a>ILA 3.5: <a href="https://textbooks.math.gatech.edu/ila/matrix-inverses.html">Matrix Inverses</a><br /></li>
<li><a id="org8461932"></a>ILA 3.6: <a href="https://textbooks.math.gatech.edu/ila/invertible-matrix-thm.html">The Invertible Matrix Theorem</a><br /></li>
</ul>
</li>
<li><a id="org849c474"></a>Slides:<br /></li>
<li><a id="org8fd7c54"></a><b>Homework 5:</b><br /></li>
</ul>
</li>
<li><a id="org3fd115a"></a>Reminders:<br />
<div class="outline-text-4" id="text-org3fd115a">
<ul class="org-ul">
<li>Homework 4 is due</li>
<li>Homework 5 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-10-04" class="outline-3">
<h3 id="10-04">FRI/MON 10-04/07 Discussion 5</h3>
<div class="outline-text-3" id="text-10-04">
</div>
<ul class="org-ul">
<li><a id="org6117c1d"></a>Topics:<br />
<div class="outline-text-4" id="text-org6117c1d">
<ul class="org-ul">
<li>Practice with matrix inversion</li>
<li>More Practice with NumPy</li>
</ul>
</div>
</li>
<li><a id="orgba9116c"></a>Material:<br /></li>
<li><a id="org00906cd"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org56eb30e" class="outline-2">
<h2 id="org56eb30e">Week 6</h2>
<div class="outline-text-2" id="text-org56eb30e">
</div>
<div id="outline-container-10-08" class="outline-3">
<h3 id="10-08">TUE 10-08 Lecture 11</h3>
<div class="outline-text-3" id="text-10-08">
</div>
<ul class="org-ul">
<li><a id="orgebd6dda"></a>Title: <b>Invertible Matrix Theorem</b><br /></li>
<li><a id="org25a08fe"></a>Topics:<br />
<div class="outline-text-4" id="text-org25a08fe">
<ul class="org-ul">
<li>Review matrix inversion</li>
<li>Connect everything we've seen so far in the case of square matrices
(one theorem to rule them all&#x2026;)</li>
</ul>
</div>
</li>
<li><a id="org2dc2a8f"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgbc10068"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgb71a65a"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L10MatrixInverse.html">The Inverse of a Matrix</a><br /></li>
<li><a id="org434ea4a"></a>ILA 3.6: <a href="https://textbooks.math.gatech.edu/ila/invertible-matrix-thm.html">The Invertible Matrix Theorem</a><br /></li>
</ul>
</li>
<li><a id="org39dd695"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org3831e09"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-10-10" class="outline-3">
<h3 id="10-10">THU 10-10 Lecture 12</h3>
<div class="outline-text-3" id="text-10-10">
</div>
<ul class="org-ul">
<li><a id="org032c9f0"></a>Title: <b>Numerics and NumPy (Part II)</b><br /></li>
<li><a id="org5453801"></a>Topics:<br />
<div class="outline-text-4" id="text-org5453801">
<ul class="org-ul">
<li>Revisit NumPy, taking stock of how it can be used to reason about
the algebra of matrices</li>
<li>See some more involved examples of using NumPy</li>
</ul>
</div>
</li>
<li><a id="org843db60"></a>Material:<br />
<ul class="org-ul">
<li><a id="org9a7e5d1"></a>Reading:<br /></li>
<li><a id="orgb870d78"></a>Slides:<br /></li>
<li><a id="org68acdbf"></a><b>Homework 6:</b><br /></li>
</ul>
</li>
<li><a id="org7d06296"></a>Reminders:<br />
<div class="outline-text-4" id="text-org7d06296">
<ul class="org-ul">
<li>Homework 5 is due</li>
<li>Homework 6 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-10-11" class="outline-3">
<h3 id="10-11">FRI/TUE 10-11/15 Discussion 6</h3>
<div class="outline-text-3" id="text-10-11">
</div>
<ul class="org-ul">
<li><a id="org888fd8a"></a>Topics:<br />
<div class="outline-text-4" id="text-org888fd8a">
<ul class="org-ul">
<li>More practice with matrix inversion</li>
<li>More practice with NumPy</li>
</ul>
</div>
</li>
<li><a id="org15cf518"></a>Material:<br /></li>
<li><a id="org59c14fb"></a>Reminders:<br />
<div class="outline-text-4" id="text-org59c14fb">
<ul class="org-ul">
<li>The discussion section normally held on Monday <b>will be held on
Tuesday</b> because of Indigenous People's Day</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
