schedule.org
** THU 10-17 Lecture 13
:PROPERTIES:
:CUSTOM_ID: 10-17
:END:
*** Title: *Algebraic Graph Theory*
*** Topics:
+ See how matrices can be used to represent graphs (a.k.a. networks)
+ See how matrix operations can be interpreted as operations on graphs
+ Set up the conceptual framework for Markov chains and PageRank
*** Material:
**** Reading:
***** TODO Algebraic Graph Theory
**** Slides:
*** Reminders:
+ Homework 6 is due
+ There is *no class on Tuesday* this week because of Indigenous People's Day
** FRI/MON 10-18/21 Discussion 7
:PROPERTIES:
:CUSTOM_ID: 10-18
:END:
*** Topics:
+ Practice with adjacency matrices
+ Examples with NetworkX
*** Material:
*** Reminders:
* Week 8
** TUE 10-22 Midterm Exam
:PROPERTIES:
:CUSTOM_ID: 10-22
:END:
+ The midterm will be held during class
+ More information TBA
** THU 10-24 Lecture 14
:PROPERTIES:
:CUSTOM_ID: 10-24
:END:
*** Title: *Markov Chains*
*** Topics:
+ Introduce Markov chains as an application of the topics we've
  covered
+ Use Markov chains to reason about the long-term behavior of linear
  dynamical systems
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html][Markov Chains]]
**** Slides:
**** *Homework 7:*
*** Reminders:
+ Homework 7 is assigned
** FRI/MON 10-25/28 Discussion 8
:PROPERTIES:
:CUSTOM_ID: 10-25
:END:
*** Topics:
+ Practice with Markov Chains
*** Material:
*** Reminders:
* Week 9
** TUE 10-29 Lecture 15
:PROPERTIES:
:CUSTOM_ID: 10-29
:END:
*** Title: *Matrix Factoriazations*
*** Topics:
+ Discuss matrix factorization in general as a way to "get more
  information" about a matrix
+ Look at the LU factorization as a faster way of solving the multiple
  matrix equations (over the same matrix)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html][Matrix Factorizations]]
**** Slides:
*** Reminders:
** THU 10-31 Lecture 16
:PROPERTIES:
:CUSTOM_ID: 10-31
:END:
*** Title: *Computer Graphics*
*** Topics:
+ Switch gears to talk about linear algebra and computer graphics, in
  particular the use of linear transformations and perspective
  transformations for rendering images of 3D objects on a 2D screen
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html][Computer Graphics]]
**** Slides:
**** *Homework 8:*
*** Reminders:
+ Homework 7 is due
+ Homework 8 is assigned
** FRI/MON 11-01/04 Dicussion 9
:PROPERTIES:
:CUSTOM_ID: 11-01
:END:
*** Topics:
+ Help with Homework 8
*** Material:
*** Reminders:
* Week 10
** TUE 11-05 Lecture 17
:PROPERTIES:
:CUSTOM_ID: 11-05
:END:
*** Title: *Subspaces*
*** Topics:
+ Introduce subspaces and bases as a way to think more generally about
  space
+ Extend our intuitions about planes in R^3 to subspaces in R^n
+ Connect subspaces to matrices and solving systems of linear
  equations
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html][Subspaces]]
***** ILA 2.6: [[https://textbooks.math.gatech.edu/ila/subspaces.html][Subspaces]]
**** Slides:
*** Reminders:
** THU 11-07 Lecture 18
:PROPERTIES:
:CUSTOM_ID: 11-07
:END:
*** Title: *Dimension and Rank*
*** Topics:
+ Introduce dimension as a way of quantifying how "large" a span is
+ Learn techniques for finding bases for the column space and the null
  space of a matrix
+ Relate the dimension of the column space and the null space of a
  matrix
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html][Dimension and Rank]]
***** ILA 2.7: [[https://textbooks.math.gatech.edu/ila/dimension.html][Basis and Dimension]]
***** ILA 2.9: [[https://textbooks.math.gatech.edu/ila/rank-thm.html][The Rank Theorem]]
**** Slides:
**** *Homework 9:*
*** Reminders:
+ Homework 8 is due
+ Homework 9 is assigned
** FRI/MON 11-08/11 Discussion 10
:PROPERTIES:
:CUSTOM_ID: 11-08
:END:
*** Topics:
+ Practice with the rank theorem
+ Practice with dimension and rank in NumPy
*** Material:
*** Reminders:
* Week 11
** TUE 11-12 Lecture 19
:PROPERTIES:
:CUSTOM_ID: 11-12
:END:
*** Title: *Eigenvalues and Eigenvectors*
*** Topics:
+ Introduce eigenvectors as as way of thinking about vectors which are
  "just stretched" by a matrix
+ Determine how to verify eigenvectors and eigenvalues of a matrix
+ Use eigenvectors to reason about linear dynamical systems
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html][Eigenvectors and Eigenvalues]]
***** ILA 5.1: [[https://textbooks.math.gatech.edu/ila/eigenvectors.html][Eigenvectors and Eigenvalues]]
**** Slides:
*** Reminders:
