schedule.html
<div id="outline-container-org16d53ee" class="outline-2">
<h2 id="org16d53ee">Week 7</h2>
<div class="outline-text-2" id="text-org16d53ee">
</div>
<div id="outline-container-10-17" class="outline-3">
<h3 id="10-17">THU 10-17 Lecture 13</h3>
<div class="outline-text-3" id="text-10-17">
</div>
<ul class="org-ul">
<li><a id="orge6c065a"></a>Title: <b>Algebraic Graph Theory</b><br /></li>
<li><a id="org6849139"></a>Topics:<br />
<div class="outline-text-4" id="text-org6849139">
<ul class="org-ul">
<li>See how matrices can be used to represent graphs (a.k.a. networks)</li>
<li>See how matrix operations can be interpreted as operations on graphs</li>
<li>Set up the conceptual framework for Markov chains and PageRank</li>
</ul>
</div>
</li>
<li><a id="orge89d1ed"></a>Material:<br />
<ul class="org-ul">
<li><a id="org3fca5c6"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgfe69ba2"></a><span class="todo TODO">TODO</span> Algebraic Graph Theory<br /></li>
</ul>
</li>
<li><a id="orga53060e"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org0d95236"></a>Reminders:<br />
<div class="outline-text-4" id="text-org0d95236">
<ul class="org-ul">
<li>Homework 6 is due</li>
<li>There is <b>no class on Tuesday</b> this week because of Indigenous People's Day</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-10-18" class="outline-3">
<h3 id="10-18">FRI/MON 10-18/21 Discussion 7</h3>
<div class="outline-text-3" id="text-10-18">
</div>
<ul class="org-ul">
<li><a id="orgc22a75d"></a>Topics:<br />
<div class="outline-text-4" id="text-orgc22a75d">
<ul class="org-ul">
<li>Practice with adjacency matrices</li>
<li>Examples with NetworkX</li>
</ul>
</div>
</li>
<li><a id="orgbb09d7d"></a>Material:<br /></li>
<li><a id="org91e2e9a"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org950eaef" class="outline-2">
<h2 id="org950eaef">Week 8</h2>
<div class="outline-text-2" id="text-org950eaef">
</div>
<div id="outline-container-10-22" class="outline-3">
<h3 id="10-22">TUE 10-22 Midterm Exam</h3>
<div class="outline-text-3" id="text-10-22">
<ul class="org-ul">
<li>The midterm will be held during class</li>
<li>More information TBA</li>
</ul>
</div>
</div>
<div id="outline-container-10-24" class="outline-3">
<h3 id="10-24">THU 10-24 Lecture 14</h3>
<div class="outline-text-3" id="text-10-24">
</div>
<ul class="org-ul">
<li><a id="orgbabb0bd"></a>Title: <b>Markov Chains</b><br /></li>
<li><a id="orga3d8538"></a>Topics:<br />
<div class="outline-text-4" id="text-orga3d8538">
<ul class="org-ul">
<li>Introduce Markov chains as an application of the topics we've
covered</li>
<li>Use Markov chains to reason about the long-term behavior of linear
dynamical systems</li>
</ul>
</div>
</li>
<li><a id="org45a19f6"></a>Material:<br />
<ul class="org-ul">
<li><a id="org293f017"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org0a7ef57"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L11MarkovChains.html">Markov Chains</a><br /></li>
</ul>
</li>
<li><a id="orgcc9f2bb"></a>Slides:<br /></li>
<li><a id="org1be8762"></a><b>Homework 7:</b><br /></li>
</ul>
</li>
<li><a id="org217f9e0"></a>Reminders:<br />
<div class="outline-text-4" id="text-org217f9e0">
<ul class="org-ul">
<li>Homework 7 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-10-25" class="outline-3">
<h3 id="10-25">FRI/MON 10-25/28 Discussion 8</h3>
<div class="outline-text-3" id="text-10-25">
</div>
<ul class="org-ul">
<li><a id="orgde4acbb"></a>Topics:<br />
<div class="outline-text-4" id="text-orgde4acbb">
<ul class="org-ul">
<li>Practice with Markov Chains</li>
</ul>
</div>
</li>
<li><a id="orge407e4b"></a>Material:<br /></li>
<li><a id="org2b20f14"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org080a0bd" class="outline-2">
<h2 id="org080a0bd">Week 9</h2>
<div class="outline-text-2" id="text-org080a0bd">
</div>
<div id="outline-container-10-29" class="outline-3">
<h3 id="10-29">TUE 10-29 Lecture 15</h3>
<div class="outline-text-3" id="text-10-29">
</div>
<ul class="org-ul">
<li><a id="orgfbfce36"></a>Title: <b>Matrix Factoriazations</b><br /></li>
<li><a id="orgc1b8fc4"></a>Topics:<br />
<div class="outline-text-4" id="text-orgc1b8fc4">
<ul class="org-ul">
<li>Discuss matrix factorization in general as a way to "get more
information" about a matrix</li>
<li>Look at the LU factorization as a faster way of solving the multiple
matrix equations (over the same matrix)</li>
</ul>
</div>
</li>
<li><a id="org9e5dfd8"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgac90d90"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgeb54b8a"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L12MatrixFactorizations.html">Matrix Factorizations</a><br /></li>
</ul>
</li>
<li><a id="orga29258c"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org35431f6"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-10-31" class="outline-3">
<h3 id="10-31">THU 10-31 Lecture 16</h3>
<div class="outline-text-3" id="text-10-31">
</div>
<ul class="org-ul">
<li><a id="org9873522"></a>Title: <b>Computer Graphics</b><br /></li>
<li><a id="org915f443"></a>Topics:<br />
<div class="outline-text-4" id="text-org915f443">
<ul class="org-ul">
<li>Switch gears to talk about linear algebra and computer graphics, in
particular the use of linear transformations and perspective
transformations for rendering images of 3D objects on a 2D screen</li>
</ul>
</div>
</li>
<li><a id="orgf5fd118"></a>Material:<br />
<ul class="org-ul">
<li><a id="org5bca601"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org7c9e226"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L13ComputerGraphics.html">Computer Graphics</a><br /></li>
</ul>
</li>
<li><a id="orge34676e"></a>Slides:<br /></li>
<li><a id="org8f2ca77"></a><b>Homework 8:</b><br /></li>
</ul>
</li>
<li><a id="org26de43e"></a>Reminders:<br />
<div class="outline-text-4" id="text-org26de43e">
<ul class="org-ul">
<li>Homework 7 is due</li>
<li>Homework 8 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-11-01" class="outline-3">
<h3 id="11-01">FRI/MON 11-01/04 Dicussion 9</h3>
<div class="outline-text-3" id="text-11-01">
</div>
<ul class="org-ul">
<li><a id="org851aae9"></a>Topics:<br />
<div class="outline-text-4" id="text-org851aae9">
<ul class="org-ul">
<li>Help with Homework 8</li>
</ul>
</div>
</li>
<li><a id="org88489bf"></a>Material:<br /></li>
<li><a id="org68cf355"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org050fd92" class="outline-2">
<h2 id="org050fd92">Week 10</h2>
<div class="outline-text-2" id="text-org050fd92">
</div>
<div id="outline-container-11-05" class="outline-3">
<h3 id="11-05">TUE 11-05 Lecture 17</h3>
<div class="outline-text-3" id="text-11-05">
</div>
<ul class="org-ul">
<li><a id="orgf12c858"></a>Title: <b>Subspaces</b><br /></li>
<li><a id="org73603bd"></a>Topics:<br />
<div class="outline-text-4" id="text-org73603bd">
<ul class="org-ul">
<li>Introduce subspaces and bases as a way to think more generally about
space</li>
<li>Extend our intuitions about planes in R<sup>3</sup> to subspaces in R<sup>n</sup></li>
<li>Connect subspaces to matrices and solving systems of linear
equations</li>
</ul>
</div>
</li>
<li><a id="org94cea92"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgda2918b"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org4749ce7"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L14Subspaces.html">Subspaces</a><br /></li>
<li><a id="org9eafd7e"></a>ILA 2.6: <a href="https://textbooks.math.gatech.edu/ila/subspaces.html">Subspaces</a><br /></li>
</ul>
</li>
<li><a id="orgc1ae9c7"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgb4687da"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-11-07" class="outline-3">
<h3 id="11-07">THU 11-07 Lecture 18</h3>
<div class="outline-text-3" id="text-11-07">
</div>
<ul class="org-ul">
<li><a id="org42d111f"></a>Title: <b>Dimension and Rank</b><br /></li>
<li><a id="orgf6451be"></a>Topics:<br />
<div class="outline-text-4" id="text-orgf6451be">
<ul class="org-ul">
<li>Introduce dimension as a way of quantifying how "large" a span is</li>
<li>Learn techniques for finding bases for the column space and the null
space of a matrix</li>
<li>Relate the dimension of the column space and the null space of a
matrix</li>
</ul>
</div>
</li>
<li><a id="org2de4fa3"></a>Material:<br />
<ul class="org-ul">
<li><a id="org9f6e707"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org41470bf"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L15DimensionRank.html">Dimension and Rank</a><br /></li>
<li><a id="org9128a80"></a>ILA 2.7: <a href="https://textbooks.math.gatech.edu/ila/dimension.html">Basis and Dimension</a><br /></li>
<li><a id="org4f55df4"></a>ILA 2.9: <a href="https://textbooks.math.gatech.edu/ila/rank-thm.html">The Rank Theorem</a><br /></li>
</ul>
</li>
<li><a id="org88c55df"></a>Slides:<br /></li>
<li><a id="orgb5db625"></a><b>Homework 9:</b><br /></li>
</ul>
</li>
<li><a id="org2cc6307"></a>Reminders:<br />
<div class="outline-text-4" id="text-org2cc6307">
<ul class="org-ul">
<li>Homework 8 is due</li>
<li>Homework 9 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-11-08" class="outline-3">
<h3 id="11-08">FRI/MON 11-08/11 Discussion 10</h3>
<div class="outline-text-3" id="text-11-08">
</div>
<ul class="org-ul">
<li><a id="orgcd6cac3"></a>Topics:<br />
<div class="outline-text-4" id="text-orgcd6cac3">
<ul class="org-ul">
<li>Practice with the rank theorem</li>
<li>Practice with dimension and rank in NumPy</li>
</ul>
</div>
</li>
<li><a id="org05c8a80"></a>Material:<br /></li>
<li><a id="orge17690f"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgdfa2911" class="outline-2">
<h2 id="orgdfa2911">Week 11</h2>
<div class="outline-text-2" id="text-orgdfa2911">
</div>
<div id="outline-container-11-12" class="outline-3">
<h3 id="11-12">TUE 11-12 Lecture 19</h3>
<div class="outline-text-3" id="text-11-12">
</div>
<ul class="org-ul">
<li><a id="orgeab5e04"></a>Title: <b>Eigenvalues and Eigenvectors</b><br /></li>
<li><a id="orgdbb0897"></a>Topics:<br />
<div class="outline-text-4" id="text-orgdbb0897">
<ul class="org-ul">
<li>Introduce eigenvectors as as way of thinking about vectors which are
"just stretched" by a matrix</li>
<li>Determine how to verify eigenvectors and eigenvalues of a matrix</li>
<li>Use eigenvectors to reason about linear dynamical systems</li>
</ul>
</div>
</li>
<li><a id="org0edcb50"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgc7a83cc"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgb3b06d0"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L16Eigenvectors.html">Eigenvectors and Eigenvalues</a><br /></li>
<li><a id="org6f1b936"></a>ILA 5.1: <a href="https://textbooks.math.gatech.edu/ila/eigenvectors.html">Eigenvectors and Eigenvalues</a><br /></li>
</ul>
</li>
