schedule.org
** THU 11-14 Lecture 20
:PROPERTIES:
:CUSTOM_ID: 11-13
:END:
*** Title: *The Characteristic Equation*
*** Topics:
+ Look breifly at the notion of the /determinant/ of a matrix
+ Determine how to /find/ eigenvalues (not just verify them)
+ Connect eigenvalues to polynomials (?)
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html][The Characteristic Equation]]
***** ILA 5.2: [[https://textbooks.math.gatech.edu/ila/characteristic-polynomial.html][The Characteristic Polynomial]]
**** Slides:
**** *Homework 10:*
*** Reminders:
+ Homework 9 is due
+ Homework 10 is assigned
** FRI/MON 11-15/18 Discussion 11
:PROPERTIES:
:CUSTOM_ID: 11-15
:END:
*** Topics:
+ Practice with eigenvalues and eigenvectors
+ More practice with NumPy
*** Material:
*** Reminders:
* Week 12
** TUE 11-19 Lecture 21
:PROPERTIES:
:CUSTOM_ID: 11-19
:END:
*** Title: *Diagonalization*
*** Topics:
+ Examine another matrix factorization related to basis changes
+ Walk through how to diagonlize a matrix
*** Material:
**** Reading:
***** LAGD: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html][Diagonalization]]
***** ILA 5.4: [[https://textbooks.math.gatech.edu/ila/diagonalization.html][Diagonalization]]
**** Slides:
*** Reminders:
** THU 11-21 Lecture 22
:PROPERTIES:
:CUSTOM_ID: 11-21
:END:
*** Title: *Orthogonality*
*** Topics:
+ Introduce familiar notions like "length" and "angles" into our study
  of vectors
+ Look at the special case of "right" angles between vectors, i.e., orthogonality
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html][Analytic Geometry in R^n]]
***** ILA 6.1: [[https://textbooks.math.gatech.edu/ila/dot-product.html][Dot Products and Orthogonality]]
**** Slides:
**** *Homework 11:*
*** Reminders:
+ Homework 10 is due
+ Homework 11 is assigned
** FRI/MON 11-22/25 Discussion 12
:PROPERTIES:
:CUSTOM_ID: 11-22
:END:
*** Topics:
+ Practice with diagonalization
+ Practice with diagonalization in NumPy
*** Material:
*** Reminders:
* Week 13
** TUE 11-26 Lecture 23
:PROPERTIES:
:CUSTOM_ID: 11-26
:END:
*** Title: *PageRank*
*** Topics:
+ Connect random walks with eigenvectors
+ Discuss PageRank and Google search from the perspective of Markov
  chains
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L19PageRank.html][PageRank]]
***** [[https://www.sciencedirect.com/science/article/pii/S016975529800110X][The anatomy of a large-scale hypertextual Web search engine]]
**** Slides:
*** Reminders:
+ There is *no class on Thursday* because of the Thanksgiving recess
* Week 14
** TUE 12-03 Lecture 24
:PROPERTIES:
:CUSTOM_ID: 12-03
:END:
*** Title: *Orthogonal Projection*
*** Topics:
+ Introduce orthogonal projection as a way of finding the "shadow" of
  a vector in a subspace
+ Connect orthogonality to matrices and linear transformations
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html][Orthogonal Sets and Projections]]
***** ILA 6.3: [[https://textbooks.math.gatech.edu/ila/projections.html][Orthogonal Projections]]
**** Slides:
*** Reminders:
+ There will be *no discussion section on Monday* because of the
  Thanksgiving recess
** THU 12-05 Lecture 25
:PROPERTIES:
:CUSTOM_ID: 12-05
:END:
*** Title: *Least Squares*
*** Topics:
+ Introduce the least squares method as a way of giving "approximate"
  solutions to systems of linear equations
+ Demonstrate the relationship between orthogonal projection and least
  squares solutions
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html][Least Squares]]
***** ILA 6.5: [[https://textbooks.math.gatech.edu/ila/least-squares.html][The Method of Least Squares]]
**** Slides:
**** *Homework 12:*
*** Reminders:
+ Homework 11 is due
+ Homework 12 is assigned (it is shorter than usual)
** FRI/MON 12-06/09 Discussion 13
:PROPERTIES:
:CUSTOM_ID: 12-06
:END:
*** Topics:
+ Practice with least squares
+ Practice with least squares in NumPy
*** Material:
*** Reminders:
* Week 15
** TUE 12-10 Lecture 26
:PROPERTIES:
:CUSTOM_ID: 12-10
:END:
*** Title: *Linear Models*
*** Topics:
+ Look at applications of linear algebra in machine learning
*** Material:
**** Reading:
***** LAGC: [[http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html][Linear Models]]
**** Slides:
*** Reminders:
+ Homework 12 is due
+ Last day of class (!)
* Week 16
** ??? ??-?? Final Exam
+ The final exam will be held during finals week
+ More information TBA
