schedule.html
<li><a id="orgdc78b46"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org8d28aef"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-11-13" class="outline-3">
<h3 id="11-13">THU 11-14 Lecture 20</h3>
<div class="outline-text-3" id="text-11-13">
</div>
<ul class="org-ul">
<li><a id="orge997f32"></a>Title: <b>The Characteristic Equation</b><br /></li>
<li><a id="org8022de6"></a>Topics:<br />
<div class="outline-text-4" id="text-org8022de6">
<ul class="org-ul">
<li>Look breifly at the notion of the <i>determinant</i> of a matrix</li>
<li>Determine how to <i>find</i> eigenvalues (not just verify them)</li>
<li>Connect eigenvalues to polynomials (?)</li>
</ul>
</div>
</li>
<li><a id="orga43a33f"></a>Material:<br />
<ul class="org-ul">
<li><a id="org2f1ca8b"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org81253b9"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L17CharacteristicEqn.html">The Characteristic Equation</a><br /></li>
<li><a id="orgc183c92"></a>ILA 5.2: <a href="https://textbooks.math.gatech.edu/ila/characteristic-polynomial.html">The Characteristic Polynomial</a><br /></li>
</ul>
</li>
<li><a id="org7def285"></a>Slides:<br /></li>
<li><a id="org07b9150"></a><b>Homework 10:</b><br /></li>
</ul>
</li>
<li><a id="orgc63df10"></a>Reminders:<br />
<div class="outline-text-4" id="text-orgc63df10">
<ul class="org-ul">
<li>Homework 9 is due</li>
<li>Homework 10 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-11-15" class="outline-3">
<h3 id="11-15">FRI/MON 11-15/18 Discussion 11</h3>
<div class="outline-text-3" id="text-11-15">
</div>
<ul class="org-ul">
<li><a id="org1a736cd"></a>Topics:<br />
<div class="outline-text-4" id="text-org1a736cd">
<ul class="org-ul">
<li>Practice with eigenvalues and eigenvectors</li>
<li>More practice with NumPy</li>
</ul>
</div>
</li>
<li><a id="org8b683a9"></a>Material:<br /></li>
<li><a id="orga6b5d7c"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org970fdb6" class="outline-2">
<h2 id="org970fdb6">Week 12</h2>
<div class="outline-text-2" id="text-org970fdb6">
</div>
<div id="outline-container-11-19" class="outline-3">
<h3 id="11-19">TUE 11-19 Lecture 21</h3>
<div class="outline-text-3" id="text-11-19">
</div>
<ul class="org-ul">
<li><a id="org4b6d937"></a>Title: <b>Diagonalization</b><br /></li>
<li><a id="org535f0ac"></a>Topics:<br />
<div class="outline-text-4" id="text-org535f0ac">
<ul class="org-ul">
<li>Examine another matrix factorization related to basis changes</li>
<li>Walk through how to diagonlize a matrix</li>
</ul>
</div>
</li>
<li><a id="orgfa8c9ee"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgff54b6a"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org4a05903"></a>LAGD: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L18Diagonalization.html">Diagonalization</a><br /></li>
<li><a id="orgeee7d1d"></a>ILA 5.4: <a href="https://textbooks.math.gatech.edu/ila/diagonalization.html">Diagonalization</a><br /></li>
</ul>
</li>
<li><a id="orgf280549"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="org2b0181a"></a>Reminders:<br /></li>
</ul>
</div>
<div id="outline-container-11-21" class="outline-3">
<h3 id="11-21">THU 11-21 Lecture 22</h3>
<div class="outline-text-3" id="text-11-21">
</div>
<ul class="org-ul">
<li><a id="org630af35"></a>Title: <b>Orthogonality</b><br /></li>
<li><a id="org50c0da7"></a>Topics:<br />
<div class="outline-text-4" id="text-org50c0da7">
<ul class="org-ul">
<li>Introduce familiar notions like "length" and "angles" into our study
of vectors</li>
<li>Look at the special case of "right" angles between vectors, i.e., orthogonality</li>
</ul>
</div>
</li>
<li><a id="org9809a9b"></a>Material:<br />
<ul class="org-ul">
<li><a id="org03c86b2"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org8c1d0ab"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L20Orthogonality.html">Analytic Geometry in R<sup>n</sup></a><br /></li>
<li><a id="org8bbb1dd"></a>ILA 6.1: <a href="https://textbooks.math.gatech.edu/ila/dot-product.html">Dot Products and Orthogonality</a><br /></li>
</ul>
</li>
<li><a id="org72b2c0b"></a>Slides:<br /></li>
<li><a id="org72934ef"></a><b>Homework 11:</b><br /></li>
</ul>
</li>
<li><a id="org992e732"></a>Reminders:<br />
<div class="outline-text-4" id="text-org992e732">
<ul class="org-ul">
<li>Homework 10 is due</li>
<li>Homework 11 is assigned</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-11-22" class="outline-3">
<h3 id="11-22">FRI/MON 11-22/25 Discussion 12</h3>
<div class="outline-text-3" id="text-11-22">
</div>
<ul class="org-ul">
<li><a id="org776540e"></a>Topics:<br />
<div class="outline-text-4" id="text-org776540e">
<ul class="org-ul">
<li>Practice with diagonalization</li>
<li>Practice with diagonalization in NumPy</li>
</ul>
</div>
</li>
<li><a id="orgb445370"></a>Material:<br /></li>
<li><a id="orgf55b592"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org4459de2" class="outline-2">
<h2 id="org4459de2">Week 13</h2>
<div class="outline-text-2" id="text-org4459de2">
</div>
<div id="outline-container-11-26" class="outline-3">
<h3 id="11-26">TUE 11-26 Lecture 23</h3>
<div class="outline-text-3" id="text-11-26">
</div>
<ul class="org-ul">
<li><a id="org87b2657"></a>Title: <b>PageRank</b><br /></li>
<li><a id="orge0ce38b"></a>Topics:<br />
<div class="outline-text-4" id="text-orge0ce38b">
<ul class="org-ul">
<li>Connect random walks with eigenvectors</li>
<li>Discuss PageRank and Google search from the perspective of Markov
chains</li>
</ul>
</div>
</li>
<li><a id="org6ffdc76"></a>Material:<br />
<ul class="org-ul">
<li><a id="org41ff127"></a>Reading:<br />
<ul class="org-ul">
<li><a id="org04a144d"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L19PageRank.html">PageRank</a><br /></li>
<li><a id="orgc7b6131"></a><a href="https://www.sciencedirect.com/science/article/pii/S016975529800110X">The anatomy of a large-scale hypertextual Web search engine</a><br /></li>
</ul>
</li>
<li><a id="orge51e6fb"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgb30ddc4"></a>Reminders:<br />
<div class="outline-text-4" id="text-orgb30ddc4">
<ul class="org-ul">
<li>There is <b>no class on Thursday</b> because of the Thanksgiving recess</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge4c513a" class="outline-2">
<h2 id="orge4c513a">Week 14</h2>
<div class="outline-text-2" id="text-orge4c513a">
</div>
<div id="outline-container-12-03" class="outline-3">
<h3 id="12-03">TUE 12-03 Lecture 24</h3>
<div class="outline-text-3" id="text-12-03">
</div>
<ul class="org-ul">
<li><a id="org8ab9532"></a>Title: <b>Orthogonal Projection</b><br /></li>
<li><a id="org792cd9f"></a>Topics:<br />
<div class="outline-text-4" id="text-org792cd9f">
<ul class="org-ul">
<li>Introduce orthogonal projection as a way of finding the "shadow" of
a vector in a subspace</li>
<li>Connect orthogonality to matrices and linear transformations</li>
</ul>
</div>
</li>
<li><a id="org538129c"></a>Material:<br />
<ul class="org-ul">
<li><a id="org791f89e"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orgcd15870"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L21OrthogonalSets.html">Orthogonal Sets and Projections</a><br /></li>
<li><a id="org6bb7e73"></a>ILA 6.3: <a href="https://textbooks.math.gatech.edu/ila/projections.html">Orthogonal Projections</a><br /></li>
</ul>
</li>
<li><a id="org8674cba"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgac8f9f8"></a>Reminders:<br />
<div class="outline-text-4" id="text-orgac8f9f8">
<ul class="org-ul">
<li>There will be <b>no discussion section on Monday</b> because of the
Thanksgiving recess</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-12-05" class="outline-3">
<h3 id="12-05">THU 12-05 Lecture 25</h3>
<div class="outline-text-3" id="text-12-05">
</div>
<ul class="org-ul">
<li><a id="org681b024"></a>Title: <b>Least Squares</b><br /></li>
<li><a id="orgf43f98e"></a>Topics:<br />
<div class="outline-text-4" id="text-orgf43f98e">
<ul class="org-ul">
<li>Introduce the least squares method as a way of giving "approximate"
solutions to systems of linear equations</li>
<li>Demonstrate the relationship between orthogonal projection and least
squares solutions</li>
</ul>
</div>
</li>
<li><a id="org90a1672"></a>Material:<br />
<ul class="org-ul">
<li><a id="orgac79901"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orga48bb46"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L22LeastSquares.html">Least Squares</a><br /></li>
<li><a id="orgab705a6"></a>ILA 6.5: <a href="https://textbooks.math.gatech.edu/ila/least-squares.html">The Method of Least Squares</a><br /></li>
</ul>
</li>
<li><a id="org612dea2"></a>Slides:<br /></li>
<li><a id="org00b4b5e"></a><b>Homework 12:</b><br /></li>
</ul>
</li>
<li><a id="org038f5ac"></a>Reminders:<br />
<div class="outline-text-4" id="text-org038f5ac">
<ul class="org-ul">
<li>Homework 11 is due</li>
<li>Homework 12 is assigned (it is shorter than usual)</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-12-06" class="outline-3">
<h3 id="12-06">FRI/MON 12-06/09 Discussion 13</h3>
<div class="outline-text-3" id="text-12-06">
</div>
<ul class="org-ul">
<li><a id="orgb4e5e21"></a>Topics:<br />
<div class="outline-text-4" id="text-orgb4e5e21">
<ul class="org-ul">
<li>Practice with least squares</li>
<li>Practice with least squares in NumPy</li>
</ul>
</div>
</li>
<li><a id="orgd0b5f8f"></a>Material:<br /></li>
<li><a id="org22f350c"></a>Reminders:<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgabab3e1" class="outline-2">
<h2 id="orgabab3e1">Week 15</h2>
<div class="outline-text-2" id="text-orgabab3e1">
</div>
<div id="outline-container-12-10" class="outline-3">
<h3 id="12-10">TUE 12-10 Lecture 26</h3>
<div class="outline-text-3" id="text-12-10">
</div>
<ul class="org-ul">
<li><a id="orgdba5618"></a>Title: <b>Linear Models</b><br /></li>
<li><a id="org764b842"></a>Topics:<br />
<div class="outline-text-4" id="text-org764b842">
<ul class="org-ul">
<li>Look at applications of linear algebra in machine learning</li>
</ul>
</div>
</li>
<li><a id="org0f7772a"></a>Material:<br />
<ul class="org-ul">
<li><a id="org1fb6f8f"></a>Reading:<br />
<ul class="org-ul">
<li><a id="orge0075eb"></a>LAGC: <a href="http://mcrovella.github.io/CS132-Geometric-Algorithms/L23LinearModels.html">Linear Models</a><br /></li>
</ul>
</li>
<li><a id="org4aa1f0b"></a>Slides:<br /></li>
</ul>
</li>
<li><a id="orgb58fff8"></a>Reminders:<br />
<div class="outline-text-4" id="text-orgb58fff8">
<ul class="org-ul">
<li>Homework 12 is due</li>
<li>Last day of class (!)</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1576348" class="outline-2">
<h2 id="org1576348">Week 16</h2>
<div class="outline-text-2" id="text-org1576348">
</div>
<div id="outline-container-org9c767e9" class="outline-3">
<h3 id="org9c767e9">??? ??-?? Final Exam</h3>
<div class="outline-text-3" id="text-org9c767e9">
<ul class="org-ul">
<li>The final exam will be held during finals week</li>
<li>More information TBA</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
